#include <iostream>
using namespace std;
int main(){
cout<<R"(
안녕하세요.
제 이름은 최우인이라고 합니다.
백준과 코드포스, 앳코더 등 대부분에서 chowin이라는 닉네임으로 활동하고 있습니다.
지금이 마지막 기회인 것 같아 이렇게 글을 적어봅니다.

백준과 처음 만난 날이 아직도 생생합니다.
대학에 입학하고, 뭔가 해야겠다는 마음 하나로 가장 유명한 온라인 저지 플랫폼인 백준에 접속해서 1000번부터 차근차근 풀어나가기 시작했습니다.
그런데 4~5번째 문제쯤에서 처음으로 벽을 만났습니다.
그때는 그 문제가 저에게 왜 그토록 큰 벽처럼 느껴졌는지...

그 벽 앞에서 처음으로 알고리즘이라는 걸 공부했습니다.
BFS가 뭔지, 재귀가 왜 이렇게 헷갈리는지, 시간복잡도가 왜 중요한지.
하나씩 이해될 때마다 느꼈던 그 작은 희열과 감동들이, 지금의 저를 만들어줬습니다.

풀고 나서 블로그에 글을 올리던 날도 기억납니다.
아무도 안 읽는 글이었지만, 누군가에게 설명하듯 정리하면서
제가 정말로 이해했는지를 스스로 확인했던 그 시간들.
그게 공부라는 걸, 백준이 가르쳐줬습니다.

1년이라는 시간 동안 백준은 제 대학 생활의 일부였습니다.
지치는 날에도 스트릭을 잇기 위해 '한 문제만 더' 하고 켰던 저의 또 하나의 안식처였고
뭔가 해냈다는 기분이 필요할 때, 어쩌면 저라는 사람의 쓸모를 확인받고 싶어 찾아오던 곳이었던 같기도 합니다.

서버가 종료된다는 소식에 괜히 마음이 먹먹해지는 건,
그만큼 이곳에서 쌓인 것들이 진짜였기 때문이겠죠.

그동안 정말 감사했습니다.
Good Bye, BOJ!
)";}